; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-7-15)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	package15 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-7 - location
	p1-4 - location
	p2-7 - location
	p3-4 - location
	p3-5 - location
	p3-6 - location
	p4-7 - location
	p5-0 - location
	p5-6 - location
	p5-8 - location
	p6-1 - location
	p6-2 - location
	p7-3 - location
	p7-5 - location
	p7-6 - location
	p9-2 - location
	p9-8 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s5)
	(at driver3 s0)
	(at driver4 s3)
	(at driver5 s6)
	(at truck1 s6)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s2)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s6)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s0)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s9)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s9)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at truck7 s6)
	(empty truck7)
	(= (load truck7) 0)
	(= (fuel-per-minute truck7) 10)
	(at package1 s6)
	(at package2 s3)
	(at package3 s3)
	(at package4 s1)
	(at package5 s6)
	(at package6 s7)
	(at package7 s2)
	(at package8 s0)
	(at package9 s8)
	(at package10 s3)
	(at package11 s2)
	(at package12 s8)
	(at package13 s7)
	(at package14 s4)
	(at package15 s7)
	(path s0 p0-7)
	(path p0-7 s0)
	(path s7 p0-7)
	(path p0-7 s7)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s2 p2-7)
	(path p2-7 s2)
	(path s7 p2-7)
	(path p2-7 s7)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(path s7 p7-6)
	(path p7-6 s7)
	(path s6 p7-6)
	(path p7-6 s6)
	(path s9 p9-2)
	(path p9-2 s9)
	(path s2 p9-2)
	(path p9-2 s2)
	(path s9 p9-8)
	(path p9-8 s9)
	(path s8 p9-8)
	(path p9-8 s8)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 69)
	(= (time-to-drive s6 s1) 69)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 74)
	(= (time-to-drive s7 s1) 74)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 25)
	(= (time-to-drive s3 s2) 25)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 35)
	(= (time-to-drive s6 s2) 35)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 71)
	(= (time-to-drive s7 s2) 71)
	(link s2 s8)
	(link s8 s2)
	(= (time-to-drive s2 s8) 39)
	(= (time-to-drive s8 s2) 39)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 75)
	(= (time-to-drive s0 s3) 75)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 52)
	(= (time-to-drive s5 s3) 52)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 63)
	(= (time-to-drive s6 s3) 63)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 98)
	(= (time-to-drive s7 s3) 98)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 66)
	(= (time-to-drive s8 s3) 66)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 58)
	(= (time-to-drive s0 s4) 58)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 67)
	(= (time-to-drive s1 s4) 67)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 5)
	(= (time-to-drive s6 s4) 5)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 91)
	(= (time-to-drive s7 s4) 91)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 51)
	(= (time-to-drive s6 s5) 51)
	(link s6 s9)
	(link s9 s6)
	(= (time-to-drive s6 s9) 34)
	(= (time-to-drive s9 s6) 34)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 96)
	(= (time-to-drive s5 s7) 96)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 50)
	(= (time-to-drive s6 s7) 50)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 43)
	(= (time-to-drive s8 s7) 43)
	(link s8 s0)
	(link s0 s8)
	(= (time-to-drive s8 s0) 8)
	(= (time-to-drive s0 s8) 8)
	(link s8 s4)
	(link s4 s8)
	(= (time-to-drive s8 s4) 28)
	(= (time-to-drive s4 s8) 28)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 99)
	(= (time-to-drive s5 s8) 99)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 41)
	(= (time-to-drive s6 s8) 41)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 13)
	(= (time-to-drive s2 s9) 13)
	(link s9 s4)
	(link s4 s9)
	(= (time-to-drive s9 s4) 28)
	(= (time-to-drive s4 s9) 28)
	(link s9 s5)
	(link s5 s9)
	(= (time-to-drive s9 s5) 63)
	(= (time-to-drive s5 s9) 63)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s7)
	(at driver3 s6)
	(at driver5 s7)
	(at truck1 s5)
	(at truck3 s8)
	(at truck4 s1)
	(at truck5 s7)
	(at truck6 s0)
	(at truck7 s6)
	(at package1 s6)
	(at package2 s0)
	(at package3 s6)
	(at package4 s2)
	(at package6 s1)
	(at package8 s1)
	(at package9 s0)
	(at package10 s7)
	(at package11 s3)
	(at package12 s7)
	(at package13 s0)
	(at package14 s2)
	(at package15 s8)
	))

(:metric minimize (+ (* 3 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (board-truck driver5 truck1 s6)
   deleted: (at driver5 s6) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 2 of 22
2. (drive-truck truck1 s6 s9 driver5)
   deleted: (at truck1 s6)
   added: (at truck1 s9)
   changed: (fuel-used) from 0 to 340
   goals met: 2 of 22
3. (walk driver1 s3 p7-3)
   deleted: (at driver1 s3)
   added: (at driver1 p7-3)
   goals met: 2 of 22
4. (load-truck package8 truck4 s0)
   deleted: (at package8 s0)
   added: (in package8 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 2 of 22
5. (board-truck driver3 truck4 s0)
   deleted: (at driver3 s0) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 2 of 22
6. (drive-truck truck4 s0 s3 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   changed: (fuel-used) from 340 to 1165
   goals met: 2 of 22
7. (load-truck package2 truck4 s3)
   deleted: (at package2 s3)
   added: (in package2 truck4)
   changed: (load truck4) from 1 to 2, (fuel-per-minute truck4) from 11 to 13
   goals met: 2 of 22
8. (load-truck package10 truck4 s3)
   deleted: (at package10 s3)
   added: (in package10 truck4)
   changed: (load truck4) from 2 to 3, (fuel-per-minute truck4) from 13 to 16
   goals met: 2 of 22
9. (load-truck package3 truck4 s3)
   deleted: (at package3 s3)
   added: (in package3 truck4)
   changed: (load truck4) from 3 to 4, (fuel-per-minute truck4) from 16 to 20
   goals met: 2 of 22
10. (walk driver4 s3 p3-6)
   deleted: (at driver4 s3)
   added: (at driver4 p3-6)
   goals met: 2 of 22
11. (disembark-truck driver5 truck1 s9)
   deleted: (driving driver5 truck1)
   added: (at driver5 s9) (empty truck1)
   goals met: 2 of 22
12. (walk driver1 p7-3 s7)
   deleted: (at driver1 p7-3)
   added: (at driver1 s7)
   goals met: 3 of 22
13. (board-truck driver5 truck5 s9)
   deleted: (at driver5 s9) (empty truck5)
   added: (driving driver5 truck5)
   goals met: 3 of 22
14. (drive-truck truck4 s3 s7 driver3)
   deleted: (at truck4 s3)
   added: (at truck4 s7)
   changed: (fuel-used) from 1165 to 3125
   goals met: 3 of 22
15. (load-truck package15 truck4 s7)
   deleted: (at package15 s7)
   added: (in package15 truck4)
   changed: (load truck4) from 4 to 5, (fuel-per-minute truck4) from 20 to 25
   goals met: 3 of 22
16. (unload-truck package10 truck4 s7)
   deleted: (in package10 truck4)
   added: (at package10 s7)
   changed: (load truck4) from 5 to 4, (fuel-per-minute truck4) from 25 to 20
   goals met: 4 of 22
17. (load-truck package6 truck4 s7)
   deleted: (at package6 s7)
   added: (in package6 truck4)
   changed: (load truck4) from 4 to 5, (fuel-per-minute truck4) from 20 to 25
   goals met: 4 of 22
18. (load-truck package13 truck4 s7)
   deleted: (at package13 s7)
   added: (in package13 truck4)
   changed: (load truck4) from 5 to 6, (fuel-per-minute truck4) from 25 to 31
   goals met: 4 of 22
19. (drive-truck truck4 s7 s8 driver3)
   deleted: (at truck4 s7)
   added: (at truck4 s8)
   changed: (fuel-used) from 3125 to 4458
   goals met: 4 of 22
20. (load-truck package12 truck4 s8)
   deleted: (at package12 s8)
   added: (in package12 truck4)
   changed: (load truck4) from 6 to 7, (fuel-per-minute truck4) from 31 to 38
   goals met: 4 of 22
21. (drive-truck truck4 s8 s7 driver3)
   deleted: (at truck4 s8)
   added: (at truck4 s7)
   changed: (fuel-used) from 4458 to 6092
   goals met: 4 of 22
22. (unload-truck package12 truck4 s7)
   deleted: (in package12 truck4)
   added: (at package12 s7)
   changed: (load truck4) from 7 to 6, (fuel-per-minute truck4) from 38 to 31
   goals met: 5 of 22
23. (drive-truck truck4 s7 s8 driver3)
   deleted: (at truck4 s7)
   added: (at truck4 s8)
   changed: (fuel-used) from 6092 to 7425
   goals met: 5 of 22
24. (load-truck package9 truck4 s8)
   deleted: (at package9 s8)
   added: (in package9 truck4)
   changed: (load truck4) from 6 to 7, (fuel-per-minute truck4) from 31 to 38
   goals met: 5 of 22
25. (unload-truck package15 truck4 s8)
   deleted: (in package15 truck4)
   added: (at package15 s8)
   changed: (load truck4) from 7 to 6, (fuel-per-minute truck4) from 38 to 31
   goals met: 6 of 22
26. (drive-truck truck4 s8 s0 driver3)
   deleted: (at truck4 s8)
   added: (at truck4 s0)
   changed: (fuel-used) from 7425 to 7673
   goals met: 6 of 22
27. (unload-truck package2 truck4 s0)
   deleted: (in package2 truck4)
   added: (at package2 s0)
   changed: (load truck4) from 6 to 5, (fuel-per-minute truck4) from 31 to 25
   goals met: 7 of 22
28. (unload-truck package9 truck4 s0)
   deleted: (in package9 truck4)
   added: (at package9 s0)
   changed: (load truck4) from 5 to 4, (fuel-per-minute truck4) from 25 to 20
   goals met: 8 of 22
29. (walk driver4 p3-6 s6)
   deleted: (at driver4 p3-6)
   added: (at driver4 s6)
   goals met: 8 of 22
30. (unload-truck package13 truck4 s0)
   deleted: (in package13 truck4)
   added: (at package13 s0)
   changed: (load truck4) from 4 to 3, (fuel-per-minute truck4) from 20 to 16
   goals met: 9 of 22
31. (board-truck driver4 truck3 s6)
   deleted: (at driver4 s6) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 9 of 22
32. (drive-truck truck3 s6 s1 driver4)
   deleted: (at truck3 s6)
   added: (at truck3 s1)
   changed: (fuel-used) from 7673 to 8363
   goals met: 9 of 22
33. (load-truck package4 truck3 s1)
   deleted: (at package4 s1)
   added: (in package4 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 9 of 22
34. (drive-truck truck4 s0 s4 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s4)
   changed: (fuel-used) from 8363 to 9291
   goals met: 9 of 22
35. (drive-truck truck4 s4 s1 driver3)
   deleted: (at truck4 s4)
   added: (at truck4 s1)
   changed: (fuel-used) from 9291 to 10363
   goals met: 10 of 22
36. (unload-truck package6 truck4 s1)
   deleted: (in package6 truck4)
   added: (at package6 s1)
   changed: (load truck4) from 3 to 2, (fuel-per-minute truck4) from 16 to 13
   goals met: 11 of 22
37. (unload-truck package8 truck4 s1)
   deleted: (in package8 truck4)
   added: (at package8 s1)
   changed: (load truck4) from 2 to 1, (fuel-per-minute truck4) from 13 to 11
   goals met: 12 of 22
38. (drive-truck truck3 s1 s7 driver4)
   deleted: (at truck3 s1)
   added: (at truck3 s7)
   changed: (fuel-used) from 10363 to 11177
   goals met: 12 of 22
39. (drive-truck truck3 s7 s2 driver4)
   deleted: (at truck3 s7)
   added: (at truck3 s2)
   changed: (fuel-used) from 11177 to 11958
   goals met: 12 of 22
40. (load-truck package11 truck3 s2)
   deleted: (at package11 s2)
   added: (in package11 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 12 of 22
41. (drive-truck truck3 s2 s3 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   changed: (fuel-used) from 11958 to 12283
   goals met: 12 of 22
42. (unload-truck package11 truck3 s3)
   deleted: (in package11 truck3)
   added: (at package11 s3)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 13 of 22
43. (drive-truck truck3 s3 s8 driver4)
   deleted: (at truck3 s3)
   added: (at truck3 s8)
   changed: (fuel-used) from 12283 to 13009
   goals met: 14 of 22
44. (drive-truck truck4 s1 s6 driver3)
   deleted: (at truck4 s1)
   added: (at truck4 s6)
   changed: (fuel-used) from 13009 to 13768
   goals met: 13 of 22
45. (unload-truck package3 truck4 s6)
   deleted: (in package3 truck4)
   added: (at package3 s6)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 14 of 22
46. (drive-truck truck3 s8 s2 driver4)
   deleted: (at truck3 s8)
   added: (at truck3 s2)
   changed: (fuel-used) from 13768 to 14197
   goals met: 13 of 22
47. (disembark-truck driver5 truck5 s9)
   deleted: (driving driver5 truck5)
   added: (at driver5 s9) (empty truck5)
   goals met: 13 of 22
48. (unload-truck package4 truck3 s2)
   deleted: (in package4 truck3)
   added: (at package4 s2)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 14 of 22
49. (drive-truck truck3 s2 s8 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s8)
   changed: (fuel-used) from 14197 to 14587
   goals met: 15 of 22
50. (disembark-truck driver3 truck4 s6)
   deleted: (driving driver3 truck4)
   added: (at driver3 s6) (empty truck4)
   goals met: 16 of 22
51. (drive-truck truck3 s8 s4 driver4)
   deleted: (at truck3 s8)
   added: (at truck3 s4)
   changed: (fuel-used) from 14587 to 14867
   goals met: 15 of 22
52. (load-truck package14 truck3 s4)
   deleted: (at package14 s4)
   added: (in package14 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 15 of 22
53. (drive-truck truck3 s4 s7 driver4)
   deleted: (at truck3 s4)
   added: (at truck3 s7)
   changed: (fuel-used) from 14867 to 15868
   goals met: 15 of 22
54. (board-truck driver5 truck5 s9)
   deleted: (at driver5 s9) (empty truck5)
   added: (driving driver5 truck5)
   goals met: 15 of 22
55. (drive-truck truck3 s7 s8 driver4)
   deleted: (at truck3 s7)
   added: (at truck3 s8)
   changed: (fuel-used) from 15868 to 16341
   goals met: 16 of 22
56. (board-truck driver3 truck4 s6)
   deleted: (at driver3 s6) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 15 of 22
57. (disembark-truck driver5 truck5 s9)
   deleted: (driving driver5 truck5)
   added: (at driver5 s9) (empty truck5)
   goals met: 15 of 22
58. (drive-truck truck3 s8 s2 driver4)
   deleted: (at truck3 s8)
   added: (at truck3 s2)
   changed: (fuel-used) from 16341 to 16770
   goals met: 14 of 22
59. (unload-truck package14 truck3 s2)
   deleted: (in package14 truck3)
   added: (at package14 s2)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 15 of 22
60. (drive-truck truck3 s2 s8 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s8)
   changed: (fuel-used) from 16770 to 17160
   goals met: 16 of 22
61. (board-truck driver5 truck5 s9)
   deleted: (at driver5 s9) (empty truck5)
   added: (driving driver5 truck5)
   goals met: 16 of 22
62. (drive-truck truck5 s9 s5 driver5)
   deleted: (at truck5 s9)
   added: (at truck5 s5)
   changed: (fuel-used) from 17160 to 17790
   goals met: 16 of 22
63. (drive-truck truck5 s5 s7 driver5)
   deleted: (at truck5 s5)
   added: (at truck5 s7)
   changed: (fuel-used) from 17790 to 18750
   goals met: 17 of 22
64. (disembark-truck driver5 truck5 s7)
   deleted: (driving driver5 truck5)
   added: (at driver5 s7) (empty truck5)
   goals met: 18 of 22
65. (disembark-truck driver4 truck3 s8)
   deleted: (driving driver4 truck3)
   added: (at driver4 s8) (empty truck3)
   goals met: 18 of 22
66. (drive-truck truck4 s6 s9 driver3)
   deleted: (at truck4 s6)
   added: (at truck4 s9)
   changed: (fuel-used) from 18750 to 19090
   goals met: 18 of 22
67. (walk driver4 s8 p9-8)
   deleted: (at driver4 s8)
   added: (at driver4 p9-8)
   goals met: 18 of 22
68. (drive-truck truck4 s9 s6 driver3)
   deleted: (at truck4 s9)
   added: (at truck4 s6)
   changed: (fuel-used) from 19090 to 19430
   goals met: 18 of 22
69. (walk driver4 p9-8 s9)
   deleted: (at driver4 p9-8)
   added: (at driver4 s9)
   goals met: 18 of 22
70. (board-truck driver4 truck1 s9)
   deleted: (at driver4 s9) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 18 of 22
71. (drive-truck truck4 s6 s9 driver3)
   deleted: (at truck4 s6)
   added: (at truck4 s9)
   changed: (fuel-used) from 19430 to 19770
   goals met: 18 of 22
72. (disembark-truck driver3 truck4 s9)
   deleted: (driving driver3 truck4)
   added: (at driver3 s9) (empty truck4)
   goals met: 18 of 22
73. (board-truck driver3 truck6 s9)
   deleted: (at driver3 s9) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 18 of 22
74. (drive-truck truck6 s9 s6 driver3)
   deleted: (at truck6 s9)
   added: (at truck6 s6)
   changed: (fuel-used) from 19770 to 20110
   goals met: 18 of 22
75. (disembark-truck driver4 truck1 s9)
   deleted: (driving driver4 truck1)
   added: (at driver4 s9) (empty truck1)
   goals met: 18 of 22
76. (drive-truck truck6 s6 s4 driver3)
   deleted: (at truck6 s6)
   added: (at truck6 s4)
   changed: (fuel-used) from 20110 to 20160
   goals met: 18 of 22
77. (board-truck driver4 truck4 s9)
   deleted: (at driver4 s9) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 18 of 22
78. (drive-truck truck4 s9 s4 driver4)
   deleted: (at truck4 s9)
   added: (at truck4 s4)
   changed: (fuel-used) from 20160 to 20440
   goals met: 18 of 22
79. (drive-truck truck4 s4 s1 driver4)
   deleted: (at truck4 s4)
   added: (at truck4 s1)
   changed: (fuel-used) from 20440 to 21110
   goals met: 19 of 22
80. (drive-truck truck6 s4 s0 driver3)
   deleted: (at truck6 s4)
   added: (at truck6 s0)
   changed: (fuel-used) from 21110 to 21690
   goals met: 20 of 22
81. (disembark-truck driver4 truck4 s1)
   deleted: (driving driver4 truck4)
   added: (at driver4 s1) (empty truck4)
   goals met: 20 of 22
82. (drive-truck truck6 s0 s4 driver3)
   deleted: (at truck6 s0)
   added: (at truck6 s4)
   changed: (fuel-used) from 21690 to 22270
   goals met: 19 of 22
83. (drive-truck truck6 s4 s6 driver3)
   deleted: (at truck6 s4)
   added: (at truck6 s6)
   changed: (fuel-used) from 22270 to 22320
   goals met: 19 of 22
84. (drive-truck truck6 s6 s8 driver3)
   deleted: (at truck6 s6)
   added: (at truck6 s8)
   changed: (fuel-used) from 22320 to 22730
   goals met: 19 of 22
85. (disembark-truck driver3 truck6 s8)
   deleted: (driving driver3 truck6)
   added: (at driver3 s8) (empty truck6)
   goals met: 19 of 22
86. (board-truck driver3 truck3 s8)
   deleted: (at driver3 s8) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 19 of 22
87. (drive-truck truck3 s8 s6 driver3)
   deleted: (at truck3 s8)
   added: (at truck3 s6)
   changed: (fuel-used) from 22730 to 23140
   goals met: 18 of 22
88. (walk driver2 s5 p5-8)
   deleted: (at driver2 s5)
   added: (at driver2 p5-8)
   goals met: 18 of 22
89. (walk driver2 p5-8 s8)
   deleted: (at driver2 p5-8)
   added: (at driver2 s8)
   goals met: 18 of 22
90. (drive-truck truck3 s6 s8 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s8)
   changed: (fuel-used) from 23140 to 23550
   goals met: 19 of 22
91. (walk driver2 s8 p9-8)
   deleted: (at driver2 s8)
   added: (at driver2 p9-8)
   goals met: 19 of 22
92. (walk driver2 p9-8 s9)
   deleted: (at driver2 p9-8)
   added: (at driver2 s9)
   goals met: 19 of 22
93. (board-truck driver2 truck1 s9)
   deleted: (at driver2 s9) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 19 of 22
94. (drive-truck truck1 s9 s5 driver2)
   deleted: (at truck1 s9)
   added: (at truck1 s5)
   changed: (fuel-used) from 23550 to 24180
   goals met: 20 of 22
95. (disembark-truck driver3 truck3 s8)
   deleted: (driving driver3 truck3)
   added: (at driver3 s8) (empty truck3)
   goals met: 20 of 22
96. (drive-truck truck1 s5 s8 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s8)
   changed: (fuel-used) from 24180 to 25170
   goals met: 19 of 22
97. (board-truck driver3 truck6 s8)
   deleted: (at driver3 s8) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 19 of 22
98. (drive-truck truck6 s8 s0 driver3)
   deleted: (at truck6 s8)
   added: (at truck6 s0)
   changed: (fuel-used) from 25170 to 25250
   goals met: 20 of 22
99. (disembark-truck driver3 truck6 s0)
   deleted: (driving driver3 truck6)
   added: (at driver3 s0) (empty truck6)
   goals met: 20 of 22
100. (drive-truck truck1 s8 s5 driver2)
   deleted: (at truck1 s8)
   added: (at truck1 s5)
   changed: (fuel-used) from 25250 to 26240
   goals met: 21 of 22
101. (walk driver3 s0 p5-0)
   deleted: (at driver3 s0)
   added: (at driver3 p5-0)
   goals met: 21 of 22
102. (walk driver3 p5-0 s5)
   deleted: (at driver3 p5-0)
   added: (at driver3 s5)
   goals met: 21 of 22
103. (walk driver3 s5 p5-6)
   deleted: (at driver3 s5)
   added: (at driver3 p5-6)
   goals met: 21 of 22
104. (walk driver3 p5-6 s6)
   deleted: (at driver3 p5-6)
   added: (at driver3 s6)
   goals met: 22 of 22
